; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj5 - airport
	obj1 obj6 - city
	obj2 obj4 obj7 obj8 obj9 obj11 obj16 - package
	obj3 obj12 - airplane
	obj10 obj14 - location
	obj13 obj15 - truck
)

(:init
	(at obj7 obj5)
	(in-city obj14 obj6)
	(in-city obj10 obj6)
	(at obj8 obj0)
	(at obj3 obj0)
	(at obj2 obj0)
	(at obj9 obj0)
	(at obj15 obj0)
	(at obj16 obj14)
	(in-city obj5 obj6)
	(at obj13 obj5)
	(at obj4 obj0)
	(at obj11 obj5)
	(at obj12 obj5)
	(in-city obj0 obj1)
)

(:goal (and
	(at obj16 obj0)
	(at obj11 obj0)
	(at obj7 obj0)
	(at obj2 obj5)
	(at obj9 obj5)
	(at obj4 obj5)
	(at obj8 obj5)
))
)

; plan
1. (load obj3 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj3)
   goals met: 0 of 7
2. (load obj3 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj3)
   goals met: 0 of 7
3. (load obj3 obj4 obj0)
   deleted: (at obj4 obj0)
   added: (in obj4 obj3)
   goals met: 0 of 7
4. (load obj3 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj3)
   goals met: 0 of 7
5. (fly obj3 obj0 obj5)
   deleted: (at obj3 obj0)
   added: (at obj3 obj5)
   goals met: 0 of 7
6. (unload obj3 obj9 obj5)
   deleted: (in obj9 obj3)
   added: (at obj9 obj5)
   goals met: 1 of 7
7. (unload obj3 obj8 obj5)
   deleted: (in obj8 obj3)
   added: (at obj8 obj5)
   goals met: 2 of 7
8. (load obj3 obj7 obj5)
   deleted: (at obj7 obj5)
   added: (in obj7 obj3)
   goals met: 2 of 7
9. (unload obj3 obj4 obj5)
   deleted: (in obj4 obj3)
   added: (at obj4 obj5)
   goals met: 3 of 7
10. (unload obj3 obj2 obj5)
   deleted: (in obj2 obj3)
   added: (at obj2 obj5)
   goals met: 4 of 7
11. (load obj3 obj11 obj5)
   deleted: (at obj11 obj5)
   added: (in obj11 obj3)
   goals met: 4 of 7
12. (fly obj3 obj5 obj0)
   deleted: (at obj3 obj5)
   added: (at obj3 obj0)
   goals met: 4 of 7
13. (unload obj3 obj7 obj0)
   deleted: (in obj7 obj3)
   added: (at obj7 obj0)
   goals met: 5 of 7
14. (unload obj3 obj11 obj0)
   deleted: (in obj11 obj3)
   added: (at obj11 obj0)
   goals met: 6 of 7
15. (drive obj13 obj5 obj14)
   deleted: (at obj13 obj5)
   added: (at obj13 obj14)
   goals met: 6 of 7
16. (load obj13 obj16 obj14)
   deleted: (at obj16 obj14)
   added: (in obj16 obj13)
   goals met: 6 of 7
17. (drive obj13 obj14 obj5)
   deleted: (at obj13 obj14)
   added: (at obj13 obj5)
   goals met: 6 of 7
18. (unload obj13 obj16 obj5)
   deleted: (in obj16 obj13)
   added: (at obj16 obj5)
   goals met: 6 of 7
19. (load obj12 obj16 obj5)
   deleted: (at obj16 obj5)
   added: (in obj16 obj12)
   goals met: 6 of 7
20. (fly obj12 obj5 obj0)
   deleted: (at obj12 obj5)
   added: (at obj12 obj0)
   goals met: 6 of 7
21. (unload obj12 obj16 obj0)
   deleted: (in obj16 obj12)
   added: (at obj16 obj0)
   goals met: 7 of 7
